Trial Case/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       IOobject;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundaryField
{
    obstacle
    {
        type            sixDoFRigidBodyDisplacement;   // 6DoF BC in v2412 [web:24]
        centreOfMass    (0 0 0);
        mass            1;
        momentOfInertia (1 1 1);
        constraints
        {
            // here you restrict to x (and optionally y) motion, fix z and rotations
        }
        restraints
        {
        }
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(top|bottom)"
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }

    // other patches: typically fixedValue (0 0 0) or slip, etc.
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

