Trial Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    in
    {
        type            patch;
        nFaces          300;
        startFace       42700;
    }
    front
    {
        type            patch;
        nFaces          400;
        startFace       43000;
    }
    back
    {
        type            patch;
        nFaces          400;
        startFace       43400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3500;
        startFace       43800;
    }
)

// ************************************************************************* //
