Trial Case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    ( 0.000000 0.000000 0.000000 )  // point 0
    ( 5.000000 0.000000 0.000000 )  // point 1
    ( 5.000000 4.000000 0.000000 )  // point 2
    ( 0.000000 4.000000 0.000000 )  // point 3
    ( 5.000000 5.000000 0.000000 )  // point 4
    ( 0.000000 5.000000 0.000000 )  // point 5
    ( 5.000000 10.000000 0.000000 )  // point 6
    ( 0.000000 10.000000 0.000000 )  // point 7
    ( 7.000000 0.000000 0.000000 )  // point 8
    ( 7.000000 4.000000 0.000000 )  // point 9
    ( 7.000000 5.000000 0.000000 )  // point 10
    ( 7.000000 10.000000 0.000000 )  // point 11
    ( 12.000000 0.000000 0.000000 )  // point 12
    ( 12.000000 4.000000 0.000000 )  // point 13
    ( 12.000000 5.000000 0.000000 )  // point 14
    ( 12.000000 10.000000 0.000000 )  // point 15
    ( 14.000000 0.000000 0.000000 )  // point 16
    ( 14.000000 4.000000 0.000000 )  // point 17
    ( 14.000000 5.000000 0.000000 )  // point 18
    ( 14.000000 10.000000 0.000000 )  // point 19
    ( 19.000000 0.000000 0.000000 )  // point 20
    ( 19.000000 4.000000 0.000000 )  // point 21
    ( 19.000000 5.000000 0.000000 )  // point 22
    ( 19.000000 10.000000 0.000000 )  // point 23
    ( 0.000000 0.000000 1.000000 )  // point 24
    ( 5.000000 0.000000 1.000000 )  // point 25
    ( 5.000000 4.000000 1.000000 )  // point 26
    ( 0.000000 4.000000 1.000000 )  // point 27
    ( 5.000000 5.000000 1.000000 )  // point 28
    ( 0.000000 5.000000 1.000000 )  // point 29
    ( 5.000000 10.000000 1.000000 )  // point 30
    ( 0.000000 10.000000 1.000000 )  // point 31
    ( 7.000000 0.000000 1.000000 )  // point 32
    ( 7.000000 4.000000 1.000000 )  // point 33
    ( 7.000000 5.000000 1.000000 )  // point 34
    ( 7.000000 10.000000 1.000000 )  // point 35
    ( 12.000000 0.000000 1.000000 )  // point 36
    ( 12.000000 4.000000 1.000000 )  // point 37
    ( 12.000000 5.000000 1.000000 )  // point 38
    ( 12.000000 10.000000 1.000000 )  // point 39
    ( 14.000000 0.000000 1.000000 )  // point 40
    ( 14.000000 4.000000 1.000000 )  // point 41
    ( 14.000000 5.000000 1.000000 )  // point 42
    ( 14.000000 10.000000 1.000000 )  // point 43
    ( 19.000000 0.000000 1.000000 )  // point 44
    ( 19.000000 4.000000 1.000000 )  // point 45
    ( 19.000000 5.000000 1.000000 )  // point 46
    ( 19.000000 10.000000 1.000000 )  // point 47
);

blocks
(
    hex (0 1 2 3 24 25 26 27)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 0
    hex (3 2 4 5 27 26 28 29)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 1
    hex (5 4 6 7 29 28 30 31)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 2
    hex (1 8 9 2 25 32 33 26)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 3
    hex (2 9 10 4 26 33 34 28)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 4
    hex (4 10 11 6 28 34 35 30)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 5
    hex (8 12 13 9 32 36 37 33)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 6
    hex (12 16 17 13 36 40 41 37)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 7
    hex (17 21 22 18 41 45 46 42)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 8
    hex (16 20 21 17 40 44 45 41)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 9
    hex (9 13 14 10 33 37 38 34)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 10
    hex (13 17 18 14 37 41 42 38)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 11
    hex (10 14 15 11 34 38 39 35)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 12
    hex (14 18 19 15 38 42 43 39)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 13
    hex (18 22 23 19 42 46 47 43)
        (10 10 10)
        simpleGrading (1.0 1.0 1.0)
        // Block 14
);

edges
(
);

boundary
(
    in
    {
        type patch;
        faces
        (
            (5 29 31 7)
            (3 27 29 5)
            (0 24 27 3)
        );
    }
    front
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (1 2 9 8)
            (5 7 6 4)
            (3 5 4 2)
        );
    }
    back
    {
        type patch;
        faces
        (
            (24 25 26 27)
            (25 32 33 26)
            (29 28 30 31)
            (27 26 28 29)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //